IdeaRS.Connections
AddedMemberData.RotationRx Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the rotation of Cross-section about X axis of the of beam.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double RotationRx { get; set; }
Property Value
Type: Double
See Also
Reference
AddedMemberData Class
IdeaRS.Connections.Data Namespace